apache/nuttx/arch/arm/src/lpc313x/lpc313x_cgudrvr.h
EXTERN int lpc313x_fdcndx(enum lpc313x_clockid_e clkid,
                          enum lpc313x_domainid_e dmnid);

/************************************************************************
 * Name: lpc313x_selectfreqin
 *
 * Description:
 *   Set the base frequency source selection for with a clock domain
 *
 ************************************************************************/

EXTERN void lpc313x_selectfreqin(enum lpc313x_domainid_e dmnid,
                                 uint32_t finsel);

/************************************************************************
 * Name: lpc313x_clkfreq
 *
 * Description:
 *   Given a clock ID and its domain ID, return the frequency of the
 *   clock.
 *
 ************************************************************************/

EXTERN uint32_t lpc313x_clkfreq(enum lpc313x_clockid_e clkid,
                                enum lpc313x_domainid_e dmnid);

/************************************************************************
 * Name: lpc313x_enableexten
 *
 * Description:
 *   Enable external enabling for the the specified possible clocks.
 *
 ************************************************************************/

EXTERN void lpc313x_enableexten(enum lpc313x_clockid_e clkid);

/************************************************************************
 * Name: lpc313x_disableexten
 *
 * Description:
 *   Disable external enabling for the the specified possible clocks.
 *
 ************************************************************************/

EXTERN void lpc313x_disableexten(enum lpc313x_clockid_e clkid);

#undef EXTERN
#ifdef __cplusplus
}
#endif

#endif /* __ASSEMBLY__ */
#endif /* __ARCH_ARM_SRC_LPC313X_CGUDRVR_H */
